export default class StageData{
    data: string[][] = [];
    offsetX: number = 0;
    offsetY: number = 0;
    width: number = 0;
    height: number = 0;
}

export class StageData1 extends StageData {
    constructor(){
        super();
        this.data = 
        [
            ["壁","壁","壁","壁","壁","壁","壁","壁","壁","壁"],
            ["壁","字","空","字","空","壁","空","空","空","壁"],
            ["壁","空","空","空","空","壁","空","空","空","壁"],
            ["壁","空","空","空","空","壁","壁","壁","空","壁"],
            ["壁","空","空","空","空","空","空","空","空","壁"],
            ["壁","空","空","空","空","空","空","空","空","壁"],
            ["壁","空","空","空","空","空","物","空","空","壁"],
            ["壁","空","空","空","空","空","空","空","空","壁"],
            ["壁","空","空","空","空","空","空","空","空","壁"],
            ["壁","壁","壁","壁","壁","壁","壁","壁","壁","壁"],
        ];
        this.offsetX = 36;
        this.offsetY = 36;
        this.width = 10;
        this.height = 10;
    }
}